SaitovSP/src/InformationRegisters/ЦеныБлюд/ЦеныБлюд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныБлюд</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Блюдо</name>
    <type>
      <types>CatalogRef.Блюда</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/Catalogs/Сертификаты/Сертификаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сертификаты</name>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/CommonModules/ОбщийСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Цена блюда.
// 
// Параметры:
//  Период Период
//  Ссылка Ссылка
// 
// Возвращаемое значение:
//  
Функция ЦенаБлюда(Период, Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныБлюдСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныБлюд.СрезПоследних(&Период, Блюдо.Ссылка = &Ссылка) КАК ЦеныБлюдСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.Цена;
	
КонецФункции

// Значение константы сумма выдачи бонусной карты.
// 
// Возвращаемое значение:
//  Произвольный, Число - Значение константы сумма выдачи бонусной карты
Функция ЗначениеКонстантыСуммаВыдачиБонуснойКарты() Экспорт

	Возврат(Константы.СуммаВыдачиБонуснойКарты.Получить());

КонецФункции 

// Статус заказа.
// 
// Параметры:
//  Статус Статус
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыБлюда - Статус заказа
Функция СтатусЗаказа (Статус) Экспорт
	
	Возврат Перечисления.СтатусыБлюда[Статус];
	
КонецФункции

// Дата выдачи сертификата.
// 
// Параметры:
//  Ссылка Ссылка на спарвочник сертификаты
// 
// Возвращаемое значение: 
// Дата
//  
Функция ДатаВыдачиСертификата(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сертификаты.ДатаВыдачи
		|ИЗ
		|	Справочник.Сертификаты КАК Сертификаты
		|ГДЕ
		|	Сертификаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ДатаВыдачи;
	КонецЦикла;
	
КонецФункции

// Сумма сертификата.
// 
// Параметры:
//  Ссылка Ссылка на спарвочник сертификаты
// 
// Возвращаемое значение: 
// Сумма
//  
Функция СуммаСертификата(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сертификаты.Сумма КАК Сумма
		|ИЗ
		|	Справочник.Сертификаты КАК Сертификаты
		|ГДЕ
		|	Сертификаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
КонецФункции
#КонецОбласти
